{
  "Greetings": "SM Nazim Uddin Shoikot",
  "Tagline": "Artificial Intelligence Engineer | Computer Science Graduate (HKU First Class Honors)",
  "Introduction1": "I am an Artificial Intelligence Engineer based in Hong Kong, focused on building production-ready machine learning systems across speech, computer vision, and LLM applications.",
  "Introduction2": "My work spans offline multilingual transcription, 3D LiDAR perception pipelines, and secure software delivery for enterprise-grade systems.",
  "Introduction3": "I hold a Bachelor of Engineering in Computer Science (First Class Honors) from The University of Hong Kong and also completed a Computer Science exchange semester at Purdue University.",
  "Introduction4": "I am open to collaborations and opportunities in applied AI, ML engineering, and intelligent product development.",
  "Education": [
    {
      "name": "THE UNIVERSITY OF HONG KONG",
      "year": "SEP 2017 – JUN 2021",
      "degree": "Bachelor of Engineering in Computer Science (First Class Honors)",
      "description": "GPA: 3.66/4.30. Selected coursework: Data Structures and Algorithm Analysis, Applied Deep Learning, Communication and Networks."
    },
    {
      "name": "PURDUE UNIVERSITY",
      "year": "AUG 2019 – DEC 2019",
      "degree": "Bachelor of Science in Computer Science (Exchange Program)",
      "description": "GPA: 3.74/4.00. Selected coursework: Design and Analysis of Algorithms (Graduate level), Operating Systems, Software Engineering."
    }
  ],
  "Experiences": [
    {
      "name": "PANTHEON LAB LIMITED",
      "year": "JUN 2024 – PRESENT",
      "position": "ARTIFICIAL INTELLIGENCE ENGINEER",
      "highlights": [
        "Developed a multilingual offline transcription app for Mac with real-time transcription and summarization (STT, LLM, MLX).",
        "Enhanced lip-sync technology for digital human interfaces to improve interaction smoothness and lower latency (GAN, PyTorch Lightning, Wav2Lip).",
        "Optimized LLMs for Nvidia and Mac architectures and performed comparative model analysis by use case (CUDA, MLX).",
        "Established vulnerability management workflows for ISO27001 compliance (Wazuh, SonarQube)."
      ]
    },
    {
      "name": "KODIFLY LIMITED",
      "year": "OCT 2022 – MAY 2024",
      "position": "ARTIFICIAL INTELLIGENCE ENGINEER",
      "highlights": [
        "Led a cross-national team of 6 engineers to deploy a 3D tree monitoring and alert system with 95% real-time risk detection accuracy.",
        "Built SLAM-based 3D mapping and synchronized camera, LiDAR, GPS, and ISPS streams for alerting and predictive risk analysis (FAST-LIO, ROS).",
        "Developed a real-time pedestrian and vehicle tracking system with height and speed estimation (PaddlePaddle, Ouster-SDK, Python).",
        "Evaluated 3D detection models for railway train detection and tree intrusion scenarios (PPYOLOe, CNN, RCNN, SFA3D, OpenPCDet, SFD)."
      ]
    },
    {
      "name": "D-ENGRAVER LIMITED",
      "year": "AUG 2021 – SEP 2022",
      "position": "SOFTWARE DEVELOPMENT ENGINEER",
      "highlights": [
        "Engineered a secure payment system with subscriptions, invoices, and 3D Authentication using Stripe.",
        "Developed object matting algorithms with pixel-level manipulation for image extraction (TypeScript).",
        "Created an automated framework for unit and visual regression testing (Node.js, React.js)."
      ]
    },
    {
      "name": "EWALKER MANAGEMENT LTD",
      "year": "JUN 2019 – MAY 2021",
      "position": "ASSOCIATE CONSULTANT – SOFTWARE ENGINEER",
      "highlights": [
        "Developed and integrated security and digital forensics tools (Go, React.js).",
        "Automated vulnerability detection testing and report generation, reducing manual effort by up to 12 hours/day.",
        "Led log data analysis, visualization, and parameter optimization workflows (Elasticsearch, Kibana)."
      ]
    }
  ],
  "Projects": [
    {
      "name": "ARTISYNTH",
      "description": "AI-driven content creation engine that transforms prompts into art and dynamic video narratives (ChatGPT, Speech Recognition, Text Summarization, Keyword Extraction, VQGAN, StyleGAN).",
      "link": ""
    },
    {
      "name": "DOCUMIND",
      "description": "Final-year project semantic search engine using vector embeddings and NLP to infer user intent and retrieve internal documents (BERT, RoBERTa, SBERT, Python, React.js, Django).",
      "link": "https://github.com/nazimshoikot/Semantic_Search_Engine"
    },
    {
      "name": "XINU FLEX",
      "description": "Operating systems experimentation project on memory/process management algorithms in Xinu (C, C++).",
      "link": "https://github.com/nazimshoikot/Xinu"
    }
  ],
  "Skills": [
    {
      "category": "Core",
      "items": "C, C++, Go, Java, JavaScript, TypeScript, Python, ROS"
    },
    {
      "category": "Web Development",
      "items": "AngularJS, Bootstrap, CSS, Django, HTML, MongoDB, MySQL, Node.js, PostgreSQL, React.js"
    },
    {
      "category": "Machine Learning",
      "items": "BERT, CNN, GAN, LLM, NLP, PyTorch, SBERT, TensorFlow, PaddlePaddle, Whisper"
    }
  ],
  "Awards": [
    "HKSAR Government Scholarship covering 100% tuition and living expenses (2017–2021)",
    "Dean's Honors List, Faculty of Engineering, HKU (2018, 2021)"
  ]
}
